In [1]:
import pandas as pd
school_data = "Resources/schools_complete.csv"
school_data_df=pd.read_csv(school_data)
student_data = "Resources/students_complete.csv"
student_data_df=pd.read_csv(student_data)

In [102]:
school_data_complete = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [103]:
school_data_complete_df=school_data_complete[["grade","math_score","school_name"]]
grade_df=school_data_complete_df.groupby(["grade"])
grade_df

In [104]:
nine_grades =school_data_complete_df[school_data_complete_df.grade == '9th']
nine_grades_df=nine_grades[["math_score","school_name"]]
ten_grades =school_data_complete_df[school_data_complete_df.grade == '10th']
ten_grades_df=ten_grades[["math_score","school_name"]]
eleven_grades =school_data_complete_df[school_data_complete_df.grade == '11th']
eleven_grades_df=eleven_grades[["math_score","school_name"]]
twelve_grades =school_data_complete_df[school_data_complete_df.grade == '12th']
twelve_grades_df=twelve_grades[["math_score","school_name"]]

In [115]:
school_df=school_data_complete_df.groupby(["school_name"])
school_df.count()

                       grade  math_score
school_name
Bailey High School      4976        4976
Cabrera High School     1858        1858
Figueroa High School    2949        2949
Ford High School        2739        2739
Griffin High School     1468        1468
Hernandez High School   4635        4635
Holden High School       427         427
Huang High School       2917        2917
Johnson High School     4761        4761
Pena High School         962         962
Rodriguez High School   3999        3999
Shelton High School     1761        1761
Thomas High School      1635        1635
Wilson High School      2283        2283
Wright High School      1800        1800